#include "HSC32EU_Registers.h"

/*************************************************************************
初始时钟设置

当外部晶振12MHZ时：
PLL 输出 F = 12X(160+0)/(6X2) = 160MHz。
输出 80/10= 8MHz
通信 160/4 = 40MHz
算法 160/2 = 80MHz
系统 160/2 = 80MHz 
*************************************************************************/
void Clock_Setting()
{
    PREDVR |= 0x0600; 		// 选择片外输入时钟为时钟源	usb使用外部时钟源
  //PREDVR |= 0x0200; 		// 选择片外输入时钟为时钟源	usb使用内部时钟源
    
    CGCSR = 0x2001009F;
    CGCSR = 0x3001009F; 	//PLL EN
    while(CGCSR & 0x80000000 != 0x80000000);
    CGCSR |= 0x04000000;

    CKDVR = 0x09030101;   	// 输出10分频，通信4分频，算法2分频，系统2分频。
    set_flash_for_80MHz();
}
 

/*************************************************************************
恢复缺省时钟设置（通信时钟除外）

当外部晶振12MHZ时：
PLL 输出 F = 12X(240+0)/(6X2) = 240MHz。
输出 60/10= 6MHz
通信 240/4 = 60MHz
算法 240/3 = 80MHz
系统 240/4 = 60MHz 
*************************************************************************/
void Clock_Resetting()
{
	PREDVR |= 0x0600; 		// 选择片外输入时钟为时钟源	usb使用外部时钟源
  //PREDVR |= 0x0200; 		// 选择片外输入时钟为时钟源	usb使用内部时钟源

	CKDVR = 0x09030203;   	// 输出10分频，通信4分频，算法3分频，系统4分频。

	while((CGCSR & 0xBFFFFFFF) != 0xB40100EF)
	{
	    CGCSR = 0x340100EF; //PLL EN
	}
	
	set_flash_for_60MHz();
}
